Revit 2026 API

# TileTileHorizontalCount Property

---

The property labeled "Tile Count" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileHorizontalCount { get; }
```
```vb
Public Shared ReadOnly Property TileHorizontalCount As String
	Get
```
```cpp
public:
static property String^ TileHorizontalCount {
	String^ get ();
}
```
```fsharp
static member TileHorizontalCount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace